const emptyText = {
  모집챌린지: {
    mainText: '현재 모집중인 챌린지가 없어요',
    subText: '다음 챌린지가 모집될 때까지 잠시만 기다려주세요!',
  },
  마이챌린지: {
    mainText: '아직 내 챌린지가 없어요',
    subText: '챌린지를 신청하고 내 챌린지를 시작해보세요!',
  },
  챌린지후기: {
    mainText: '남기신 후기가 없어요',
    subText: '챌린지에 참여하시고 후기를 남겨보세요!',
  },
  내후기: {
    mainText: '남기신 후기가 없어요',
    subText: '마이챌린지에서 참여하신 챌린지 후기를 남겨보세요!',
  },
  예치금내역: {
    mainText: '예치금 내역이 없어요',
    subText: '예치금을 걸어서 챌린지에 참여해보세요!',
  },
  인증내역: {
    mainText: '인증 내역이 없어요',
    subText: '아무도 인증을 하지 않은 날입니다.',
  },
  커밋인증: {
    mainText: '나만의 커밋 인증',
    subText: '1일 1커밋 챌린지는 내 인증 내역만 볼 수 있습니다.',
  },
  알림내역: {
    mainText: '알림 목록이 비어 있어요',
    subText: '최근 2주 동안 받은 알림을 확인할 수 있어요.',
  },
};

export default emptyText;
